{
    "title": "1Password 8 Managed Preferences",
    "description": "Managed Preferences for 1Password 8",
    "__version": "1.0",
    "__preferencedomain": "com.1password.1password",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://support.1password.com/mobile-device-management/"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "security.authenticatedUnlock.appleTouchId": {
            "title": "Allow Touch ID",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "security.authenticatedUnlock.appleWatchUnlock": {
            "title": "Allow Apple Watch Unlock",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "security.revealPasswords": {
            "title": "Allow Revealing Passwords",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "security.autolock.onDeviceLock": {
            "title": "Lock on Sleep, Screen Saver, or Switching User Accounts",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "security.autolock.onWindowClose": {
            "title": "Lock when Main Windows is Closed",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "security.autolock.minutes": {
            "title": "Set Auto Lock Timeout in Minutes",
            "description": "(security.autolock.minutes)-Set a value between 1 and 1440 minutes",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "minimum": 1,
                    "maximum": 1440,
                    "default": 15
                }
            ]
        },
        "security.clipboard.clearAfter": {
            "title": "Clear Clipboard after Timeout",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "security.deviceClipboardSharing": {
            "title": "Allow Universal Clipboard",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "privacy.downloadRichIcons": {
            "title": "Show app and website icons",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "privacy.checkHibp": {
            "title": "Check for vulnerable passwords",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },"updates.autoUpdate": {
            "title": "Automatically check for updates",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "updates.updateChannel": {
            "title": "Set release channel",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {

                        "enum_titles": ["Production", "Beta", "Nightly"]
                        
                        },
                    "enum": ["PRODUCTION", "BETA", "NIGHTLY"]    
                }
            ]
        }
    }
}
